SALE USING TOKEN & MIT COF.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>{{MerchantID}}</wsse:Username>
        <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">{{TransactionSecurityKey}}</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <requestMessage xmlns="urn:schemas-cybersource-com:transaction-data-{{Version}}">
       <merchantID>{{MerchantID}}</merchantID>
      <merchantReferenceCode>{{$timestamp}}</merchantReferenceCode>
         <purchaseTotals>
            <currency>USD</currency>
            <grandTotalAmount>3.00</grandTotalAmount>
         </purchaseTotals>
         <recurringSubscriptionInfo>
            <subscriptionID>5555364114256582904012</subscriptionID>
         </recurringSubscriptionInfo>
         <ccAuthService run="true">
            <commerceIndicator>recurring</commerceIndicator>
         </ccAuthService>
         <ccCaptureService run="true"/>
         <subsequentAuthTransactionID>5555364114256582904012</subsequentAuthTransactionID>
      </requestMessage>
  </soapenv:Body>
</soapenv:Envelope>